[
  {
    "rewrite_mapped_id": 1,
    "title": "Harry Potter and the Philosopher's Stone",
    "on_sale": 1,
    "rating": 4.98,
    "sold_count": 50321,
    "review_count": 9701,
    "basic_price": 19.99,
    "category_id": 1,
    "is_featured": 1,
    "product_type_id": 1,
    "publisher": "Bloomsbury Publishing",
    "author": "J. K. Rowling",
    "language": "English",
    "description": "Harry Potter's life is ordinary and bleak until a mysterious letter arrives on his eleventh birthday. Spirited away to Hogwarts School of Witchcraft and Wizardry, he discovers a hidden world, makes lifelong friends, and uncovers the truth about his parents' fate. The castle is a maze of secrets, shifting staircases, and talking portraits that both delight and endanger him. A dark wizard once thought vanquished begins to stir, and an ancient stone becomes the focus of their clash. Friendship, courage, and sacrifice light Harry's path as he steps into a destiny larger than he ever imagined.",
    "image_path": "placeholders/books/hp1.jpg",
    "image_url": "https://covers.openlibrary.org/b/isbn/9780747532699-L.jpg"
  },
  {
    "rewrite_mapped_id": 2,
    "title": "Harry Potter and the Chamber of Secrets",
    "on_sale": 1,
    "rating": 4.9,
    "sold_count": 43112,
    "review_count": 8502,
    "basic_price": 21.99,
    "category_id": 1,
    "is_featured": 1,
    "product_type_id": 1,
    "publisher": "Bloomsbury Publishing",
    "author": "J. K. Rowling",
    "language": "English",
    "description": "Harry returns to Hogwarts despite dire warnings, only to find the school plagued by mysterious attacks and chilling messages scrawled on stone walls. Whispers of a secret chamber and an ancient monster grip the student body with fear. With Ron and Hermione at his side, Harry follows a breadcrumb trail of myths, ghosts, and forbidden spells. History repeats itself as prejudice against Muggle-born students festers in dark corners. In the bowels of the castle, Harry must face a memory brought to life and a serpent bred for terror.",
    "image_path": "placeholders/books/hp2.jpg",
    "image_url": "https://covers.openlibrary.org/b/isbn/9780747538493-L.jpg"
  },
  {
    "rewrite_mapped_id": 3,
    "title": "Harry Potter and the Prisoner of Azkaban",
    "on_sale": 1,
    "rating": 4.95,
    "sold_count": 40205,
    "review_count": 7800,
    "basic_price": 22.99,
    "category_id": 1,
    "is_featured": 1,
    "product_type_id": 1,
    "publisher": "Bloomsbury Publishing",
    "author": "J. K. Rowling",
    "language": "English",
    "description": "A notorious prisoner, Sirius Black, escapes from Azkaban and the wizarding world trembles. Dementors haunt the castle grounds, draining warmth and joy from everyone they encounter. Harry learns chilling truths about the night his parents died, truths that blur the line between enemy and friend. Time itself bends as Hermione reveals a closely guarded secret and together they attempt to rewrite fate. Ultimately, Harry must choose between vengeance and mercy under the moonlit silhouette of a werewolf.",
    "image_path": "placeholders/books/hp3.jpg",
    "image_url": "https://covers.openlibrary.org/b/isbn/9780747542155-L.jpg"
  },
  {
    "rewrite_mapped_id": 4,
    "title": "Harry Potter and the Goblet of Fire",
    "on_sale": 1,
    "rating": 4.88,
    "sold_count": 38220,
    "review_count": 7204,
    "basic_price": 25.99,
    "category_id": 1,
    "is_featured": 0,
    "product_type_id": 1,
    "publisher": "Bloomsbury Publishing",
    "author": "J. K. Rowling",
    "language": "English",
    "description": "Hogwarts hosts the legendary Triwizard Tournament, pitting champions against near-impossible magical trials. Harry is unwillingly thrust into the competition and forced to navigate dragons, underwater kingdoms, and a lethal hedge maze. Alliances form and fracture among strangers from foreign schools, exposing rivalries and hidden plots. Beneath the spectacle, a cult of dark wizards conspires to resurrect a fallen master. The final challenge leaves one champion dead and the wizarding world teetering on the edge of open war.",
    "image_path": "placeholders/books/hp4.jpg",
    "image_url": "https://covers.openlibrary.org/b/isbn/9780747546245-L.jpg"
  },
  {
    "rewrite_mapped_id": 5,
    "title": "Harry Potter and the Order of the Phoenix",
    "on_sale": 0,
    "rating": 4.8,
    "sold_count": 36793,
    "review_count": 6809,
    "basic_price": 26.99,
    "category_id": 1,
    "is_featured": 0,
    "product_type_id": 1,
    "publisher": "Bloomsbury Publishing",
    "author": "J. K. Rowling",
    "language": "English",
    "description": "The Ministry denies the Dark Lord's return while fear festers in every corner of the wizarding world. Hogwarts falls under the suffocating control of Dolores Umbridge, whose pink office hides a cruel heart. Harry struggles with prophetic dreams and a growing link to his enemy's mind. Re-forming Dumbledore's Army, he teaches friends to fight against tyranny and indifference alike. In a tragic duel of prophecy and loyalty, Harry suffers a loss that steels his resolve for the battle ahead.",
    "image_path": "placeholders/books/hp5.jpg",
    "image_url": "https://covers.openlibrary.org/b/isbn/9780747551003-L.jpg"
  },

  {
    "rewrite_mapped_id": 6,
    "title": "The Call of Cthulhu and Other Weird Stories",
    "on_sale": 1,
    "rating": 4.4,
    "sold_count": 15321,
    "review_count": 2300,
    "basic_price": 16.50,
    "category_id": 1,
    "is_featured": 1,
    "product_type_id": 1,
    "publisher": "Penguin Classics",
    "author": "H. P. Lovecraft",
    "language": "English",
    "description": "Through fragmented diaries, press clippings, and eyewitness tales, a chilling mosaic of cosmic dread emerges. A cult venerating the sleeping god Cthulhu festers in the remote corners of the globe. Dreams of monolithic cities beneath the Pacific hint at humanity’s fragility before alien gods. Lovecraft’s prose grips the reader with creeping terror that transcends time and continent. Each story in the volume whispers that ignorance may be humankind's only true protection against unimaginable horror.",
    "image_path": "placeholders/books/cthulhu.jpg",
    "image_url": "https://covers.openlibrary.org/b/isbn/9780141182346-L.jpg"
  },
  {
    "rewrite_mapped_id": 7,
    "title": "At the Mountains of Madness",
    "on_sale": 1,
    "rating": 4.33,
    "sold_count": 11234,
    "review_count": 1789,
    "basic_price": 14.99,
    "category_id": 1,
    "is_featured": 0,
    "product_type_id": 1,
    "publisher": "Modern Library",
    "author": "H. P. Lovecraft",
    "language": "English",
    "description": "An ill-fated Antarctic expedition uncovers impossible fossils and an ancient city buried beneath the ice. Towering cyclopean architecture tells of a civilization predating mankind by eons. As explorers delve deeper, murals reveal a brutal war between alien races and a chilling fate for the city's creators. Horrific revelations drive men to madness while shapeless entities stalk the frozen tunnels. In the polar night, knowledge proves more lethal than any blizzard, and the last survivors flee from truths that should never be known.",
    "image_path": "placeholders/books/mountains.jpg",
    "image_url": "https://covers.openlibrary.org/b/isbn/9780812974416-L.jpg"
  },
  {
    "rewrite_mapped_id": 8,
    "title": "The Shadow over Innsmouth",
    "on_sale": 0,
    "rating": 4.26,
    "sold_count": 9876,
    "review_count": 1605,
    "basic_price": 13.49,
    "category_id": 1,
    "is_featured": 0,
    "product_type_id": 1,
    "publisher": "Del Rey",
    "author": "H. P. Lovecraft",
    "language": "English",
    "description": "A curious traveler detours through a decaying New England fishing village shunned by outsiders. Innsmouth reeks of salt marshes and sullen eyes that gleam with inhuman secrets. Strange gold jewelry hints at profane alliances beneath the sea. As night falls, gnarled lanes echo with a ritualistic chant to ancient ocean gods. Flight becomes transformation as the narrator discovers a heritage darker and deeper than the Atlantic.",
    "image_path": "placeholders/books/innsmouth.jpg",
    "image_url": "https://covers.openlibrary.org/b/isbn/9780345482559-L.jpg"
  },
  {
    "rewrite_mapped_id": 9,
    "title": "The Dunwich Horror",
    "on_sale": 1,
    "rating": 4.18,
    "sold_count": 9234,
    "review_count": 1500,
    "basic_price": 12.99,
    "category_id": 1,
    "is_featured": 0,
    "product_type_id": 1,
    "publisher": "Tor Classics",
    "author": "H. P. Lovecraft",
    "language": "English",
    "description": "In the backwoods village of Dunwich, a malformed child grows at an impossible rate, worshiping unseen forces atop a wind-scoured hill. Whispered incantations vibrate among decrepit farmhouses and stone circles. Scholars at Miskatonic University grapple with crumbling tomes in a desperate bid to avert catastrophe. An invisible colossus stalks the valley, shattering barns and sanity alike. The fate of New England—and perhaps the universe—rests upon deciphering eldritch hieroglyphs before the final gate opens.",
    "image_path": "placeholders/books/dunwich.jpg",
    "image_url": "https://covers.openlibrary.org/b/isbn/9780765322822-L.jpg"
  },
  {
    "rewrite_mapped_id": 10,
    "title": "The Colour Out of Space",
    "on_sale": 1,
    "rating": 4.2,
    "sold_count": 8456,
    "review_count": 1422,
    "basic_price": 11.99,
    "category_id": 1,
    "is_featured": 0,
    "product_type_id": 1,
    "publisher": "Ballantine Books",
    "author": "H. P. Lovecraft",
    "language": "English",
    "description": "A meteor crashes onto a secluded farm, leaking an indescribable hue that defies the known spectrum. Vegetation grows lush then withers to grey dust, while animals warp into grotesque shapes. Madness gnaws at the Gardner family as their well water shimmers with an otherworldly glow. Scientists probe the crater yet fail to capture its chromatic essence. When the farm collapses into a silent pit, the surrounding hills remember the colour that drank the land dry.",
    "image_path": "placeholders/books/colour.jpg",
    "image_url": "https://covers.openlibrary.org/b/isbn/9780345329458-L.jpg"
  },

  {
    "rewrite_mapped_id": 11,
    "title": "The Hobbit",
    "on_sale": 1,
    "rating": 4.93,
    "sold_count": 41230,
    "review_count": 9200,
    "basic_price": 18.99,
    "category_id": 1,
    "is_featured": 1,
    "product_type_id": 1,
    "publisher": "HarperCollins",
    "author": "J. R. R. Tolkien",
    "language": "English",
    "description": "Bilbo Baggins enjoys a quiet life in Bag End until the wizard Gandalf and thirteen dwarves arrive uninvited for tea. Dragged into a quest to reclaim a stolen kingdom, Bilbo braves trolls, goblins, and giant spiders. Deep within the Misty Mountains he stumbles upon a magic ring and a creature named Gollum, altering Middle-earth forever. The dragon Smaug's simmering wrath threatens to ignite a war of five armies. Along the way Bilbo discovers unexpected reservoirs of courage and cunning that redefine what it means to be a hero.",
    "image_path": "placeholders/books/hobbit.jpg",
    "image_url": "https://covers.openlibrary.org/b/isbn/9780261103344-L.jpg"
  },
  {
    "rewrite_mapped_id": 12,
    "title": "The Fellowship of the Ring",
    "on_sale": 1,
    "rating": 4.92,
    "sold_count": 38900,
    "review_count": 8700,
    "basic_price": 19.99,
    "category_id": 1,
    "is_featured": 1,
    "product_type_id": 1,
    "publisher": "HarperCollins",
    "author": "J. R. R. Tolkien",
    "language": "English",
    "description": "Middle-earth darkens as the Dark Lord Sauron seeks the One Ring that will enslave all free peoples. Frodo Baggins inherits the Ring and a perilous duty: bear it to the fires of Mount Doom. A fellowship of hobbits, a wizard, a dwarf, an elf, and two men vows to shield him on the journey. Along mist-shrouded rivers and ancient forests, friendships are tested by betrayal and the lure of power. The Fellowship shatters at Amon Hen, setting each member on divergent paths that will shape the fate of an age.",
    "image_path": "placeholders/books/fellowship.jpg",
    "image_url": "https://covers.openlibrary.org/b/isbn/9780261102354-L.jpg"
  },
  {
    "rewrite_mapped_id": 13,
    "title": "The Two Towers",
    "on_sale": 1,
    "rating": 4.91,
    "sold_count": 37450,
    "review_count": 8200,
    "basic_price": 19.99,
    "category_id": 1,
    "is_featured": 0,
    "product_type_id": 1,
    "publisher": "HarperCollins",
    "author": "J. R. R. Tolkien",
    "language": "English",
    "description": "The broken Fellowship scatters across Rohan and Gondor while Sauron’s armies muster. Merry and Pippin flee into Fangorn Forest where they rouse ancient Ents against the sorcerer Saruman. Aragorn, Legolas, and Gimli ride against time to defend the fortress of Helm’s Deep from ten thousand Uruk-hai. Meanwhile Frodo and Sam trust the treacherous Gollum to guide them through the Dead Marshes and beyond Mordor’s black gates. Hope flickers as war drums echo between the towers of Orthanc and Barad-dûr.",
    "image_path": "placeholders/books/twotowers.jpg",
    "image_url": "https://covers.openlibrary.org/b/isbn/9780261102361-L.jpg"
  },
  {
    "rewrite_mapped_id": 14,
    "title": "The Return of the King",
    "on_sale": 1,
    "rating": 4.95,
    "sold_count": 36540,
    "review_count": 8000,
    "basic_price": 19.99,
    "category_id": 1,
    "is_featured": 1,
    "product_type_id": 1,
    "publisher": "HarperCollins",
    "author": "J. R. R. Tolkien",
    "language": "English",
    "description": "War engulfs Gondor as Sauron's legions lay siege to Minas Tirith. Aragorn claims the Paths of the Dead to muster phantom allies and reclaim his birthright. In the shadows of Mount Doom, Frodo falters beneath the Ring’s corrupting weight while Sam refuses to abandon hope. A last stand at the Black Gate buys a sliver of time for two hobbits to scale the volcano’s throat. When the Ring meets fire, an age ends and still the scars of sacrifice carve the hearts of heroes.",
    "image_path": "placeholders/books/returnking.jpg",
    "image_url": "https://covers.openlibrary.org/b/isbn/9780261102378-L.jpg"
  },
  {
    "rewrite_mapped_id": 15,
    "title": "The Silmarillion",
    "on_sale": 0,
    "rating": 4.6,
    "sold_count": 22100,
    "review_count": 5000,
    "basic_price": 24.50,
    "category_id": 1,
    "is_featured": 0,
    "product_type_id": 1,
    "publisher": "HarperCollins",
    "author": "J. R. R. Tolkien",
    "language": "English",
    "description": "Before hobbits and rings, the world was sung into existence by immortal spirits whose harmonies clashed in pride and beauty. The jewels called Silmarils ignite a war of light against the hunger of Morgoth, the first Dark Lord. Elves journey across icy wastes, forge unbreakable oaths, and doom entire kingdoms in pursuit of stolen glory. Men rise from darkness, forging alliances that briefly stem the tide of evil. The tragedy of hope and hubris shapes Middle-earth for ages to come.",
    "image_path": "placeholders/books/silmarillion.jpg",
    "image_url": "https://covers.openlibrary.org/b/isbn/9780618391110-L.jpg"
  },

  {
    "rewrite_mapped_id": 16,
    "title": "Foundation",
    "on_sale": 1,
    "rating": 4.42,
    "sold_count": 28800,
    "review_count": 6100,
    "basic_price": 15.99,
    "category_id": 1,
    "is_featured": 1,
    "product_type_id": 1,
    "publisher": "Spectra",
    "author": "Isaac Asimov",
    "language": "English",
    "description": "Psychologist Hari Seldon perfects psychohistory, a science that mathematically predicts the collapse of the Galactic Empire. To safeguard future knowledge, he creates the Foundation on the rim of the galaxy. Warlords and religious zealots rise from the ashes of imperial decay, but Seldon's pre-recorded 'Crises' guide the Foundation's responses. Each success cements a new mythology of inevitability. Yet lurking beyond Seldon’s equations, an unpredictable force prepares to rewrite destiny.",
    "image_path": "placeholders/books/foundation.jpg",
    "image_url": "https://covers.openlibrary.org/b/isbn/9780553293357-L.jpg"
  },
  {
    "rewrite_mapped_id": 17,
    "title": "Foundation and Empire",
    "on_sale": 1,
    "rating": 4.38,
    "sold_count": 25400,
    "review_count": 5600,
    "basic_price": 15.99,
    "category_id": 1,
    "is_featured": 0,
    "product_type_id": 1,
    "publisher": "Spectra",
    "author": "Isaac Asimov",
    "language": "English",
    "description": "The decaying remnants of the Galactic Empire launch a last gasp offensive against the upstart Foundation. Military genius Bel Riose threatens to derail Seldon’s plan, but politics and paranoia within the Empire prove equally lethal. In the power vacuum emerges the Mule, a mutant with the ability to bend emotions to his will. His rise disrupts the psychohistorical equations, pushing humanity onto an unknown path. Hope rests with a small band of scholars who suspect another, hidden Foundation may exist.",
    "image_path": "placeholders/books/foundation_empire.jpg",
    "image_url": "https://covers.openlibrary.org/b/isbn/9780553293371-L.jpg"
  },
  {
    "rewrite_mapped_id": 18,
    "title": "Second Foundation",
    "on_sale": 1,
    "rating": 4.37,
    "sold_count": 24010,
    "review_count": 5400,
    "basic_price": 15.99,
    "category_id": 1,
    "is_featured": 0,
    "product_type_id": 1,
    "publisher": "Spectra",
    "author": "Isaac Asimov",
    "language": "English",
    "description": "The Mule's relentless search for the secretive Second Foundation drives him to the brink of galactic domination. Meanwhile, survivors of the original Foundation fear mental enslavement and hunt for their hidden protectors. Tensions culminate in a battle of intellect where telepathy counters emotional manipulation. Ultimately, the Second Foundation reveals itself just long enough to reset the Seldon Plan. Their shadowy guardianship safeguards humanity—but at the price of free will.",
    "image_path": "placeholders/books/second_foundation.jpg",
    "image_url": "https://covers.openlibrary.org/b/isbn/9780553293364-L.jpg"
  },
  {
    "rewrite_mapped_id": 19,
    "title": "I, Robot",
    "on_sale": 1,
    "rating": 4.4,
    "sold_count": 33000,
    "review_count": 7000,
    "basic_price": 14.99,
    "category_id": 1,
    "is_featured": 1,
    "product_type_id": 1,
    "publisher": "Spectra",
    "author": "Isaac Asimov",
    "language": "English",
    "description": "A series of linked stories chronicles the evolution of positronic robots bound by the Three Laws. From a child's protective playmate to planetary-scale supercomputers, robots wrestle with the grey areas of morality. Dr. Susan Calvin unravels paradoxes where absolute obedience yields unforeseen rebellion. Each tale forces humanity to weigh its reliance on artificial servants against its own ethical shortcomings. In the end, the line between programmer and programmed blurs beyond easy definition.",
    "image_path": "placeholders/books/irobot.jpg",
    "image_url": "https://covers.openlibrary.org/b/isbn/9780553382563-L.jpg"
  },
  {
    "rewrite_mapped_id": 20,
    "title": "The Caves of Steel",
    "on_sale": 0,
    "rating": 4.3,
    "sold_count": 19000,
    "review_count": 4500,
    "basic_price": 14.50,
    "category_id": 1,
    "is_featured": 0,
    "product_type_id": 1,
    "publisher": "Spectra",
    "author": "Isaac Asimov",
    "language": "English",
    "description": "Earth’s teeming megacities sprawl beneath domed roofs, cut off from open sky and agrarian Spacer worlds. Detective Elijah Baley is partnered with R. Daneel Olivaw—a humanoid robot—to solve a politically explosive murder. Prejudice against robots simmers, threatening to ignite mass unrest. Clues point to a conspiracy that could shatter the uneasy balance between Earthmen and Spacers. Baley’s loyalty, intellect, and deepest fears are tested in the echoing steel corridors of New York.",
    "image_path": "placeholders/books/caves_steel.jpg",
    "image_url": "https://covers.openlibrary.org/b/isbn/9780553293401-L.jpg"
  }
]
